In [2]:
import numpy as np
import pandas as pd

In [16]:
e = pd.read_csv("/home/smy/data100/week1/test.csv")
# e.set_index('year',inplace=True)

In [ ]:
e.iloc[[1,2,3],[0,1]]
e.iloc[[1,2,3],:]
e

   year name  percent
0  2003  smy       23
1  2005  wfv       12
2  2006  sdf       32
3  2003  eef      132
4  2006  dfd      122
5  2005  dee       22
6  2003  cff       11

In [26]:
e['year']#只能截取一整列/行
e[1:2]
e[e.index % 2 == 0]

logical_operator = e['year'] == 2003
e[logical_operator]

   year name  percent
0  2003  smy       23
1  2003  wfv       12
2  2003  sdf       32
3  2003  eef      132
4  2003  dfd      122
5  2003  dee       22
6  2003  cff       11

In [4]:
e[(e['year'] == 2003) | (e['year'] == 2005)]

   year name  percent
0  2003  smy       23
1  2005  wfv       12
3  2003  eef      132
5  2005  dee       22
6  2003  cff       11

In [7]:
years = [2003,2004]
e[e['year'].isin(years)]
#e[''].str.startswith('A')

   year name  percent
0  2003  smy       23
3  2003  eef      132
6  2003  cff       11

数据增删操作

In [17]:
name_length = e['name'].str.len()
e["name_length"] = name_length
#rename
e.rename(columns={'name':'full_name'},inplace=True)
e

   year full_name  percent  name_length
0  2003       smy       23            3
1  2005       wfv       12            3
2  2006       sdf       32            3
3  2003       eef      132            3
4  2006       dfd      122            3
5  2005       dee       22            3
6  2003       cff       11            3

In [18]:
#remove 
e.drop("name_length",axis='columns',inplace=True)
e

   year full_name  percent
0  2003       smy       23
1  2005       wfv       12
2  2006       sdf       32
3  2003       eef      132
4  2006       dfd      122
5  2005       dee       22
6  2003       cff       11

有用的api

In [ ]:
#np.max min mean
display(e.shape)
display(e.size)
display(e.describe())
# np.max(e['year'])

(7, 3)

21

              year     percent
count     7.000000    7.000000
mean   2004.428571   50.571429
std       1.397276   52.769490
min    2003.000000   11.000000
25%    2003.000000   17.000000
50%    2005.000000   23.000000
75%    2005.500000   77.000000
max    2006.000000  132.000000

np.int64(2006)

In [27]:
e.sample(3).iloc[:,:]

   year full_name  percent
3  2003       eef      132
4  2006       dfd      122
0  2003       smy       23

In [38]:
e['year'].value_counts()

year
2003    3
2005    2
2006    2
Name: count, dtype: int64

In [39]:
e['year'].unique()

array([2003, 2005, 2006])

In [45]:
e.sort_values('full_name',inplace=True)
e

   year full_name  percent
6  2003       cff       11
5  2005       dee       22
4  2006       dfd      122
3  2003       eef      132
2  2006       sdf       32
0  2003       smy       23
1  2005       wfv       12